SnyUmd/Arduino_ESP32/Hct/Hct201_After/src/hctMain.cpp
        // モータを動かす前にクロージングタイマーをセット
        // if(device.flgNow) len = device.nowLength;
        // else len = device.length;

        //クローズタイマーセット
        startTimerInterrupt(device.tClose, 3000000, false);
        
        motorAction(MOTOR_OPEN, MOTOR_RANGE, bl_food);
        device.flgNow = false;

        if(!ringed)
        {
            canRing = true;
            if(bl_food && deviceSts_W.ringing) canRing = false;
            else if(deviceSts_F.ringing) canRing = false;
            else if(setRinging) canRing = false;
            else canRing = true;
            if (canRing && device.ring && !device.ringing)
            {
                device.ringing = true;
                // p_device = &device;
                setHctMelody(sr, device.melody.c_str());
                device.ringing = false;
                ringed = true;
                // p_device = &device;
            }
        }
        
    }
    // if(device.closing && device.opened)
    if(device.closing && device.opened)
    {
        // device.serverInit = false;
        device.closing = false;
        device.opened = false;
        motorAction(MOTOR_CLOSE, MOTOR_RANGE, bl_food);
        digitalWrite(device.portLED, LED_OFF);
        // device.serverInit = true;
    }
    if(device.adjustment && !device.opened)
    {
        motorAction(device.adjustmentLeft, device.adjustMotion, bl_food);
        device.adjustment = false;
    }
    led_cnt++;
    if(led_cnt > 500)
    {
        led_cnt = 0;
        if(device.interval > 0 && !device.opened){
            digitalWrite(device.portLED, !digitalRead(device.portLED));
        }
    }
    delay(1);

}


//***************************************************************************************************************
//***************************************************************************************************************
//***************************************************************************************************************

//*************************************
void setHttpAction()
{
    //バルブオープン
    server.on(httpContents[enmNow], HTTP_ANY, [](){setDevice(enmNow);});
    //セット
    server.on(httpContents[enmSet], HTTP_ANY, [](){setDevice(enmSet);});

    //値取得
    server.on(httpContents[enmGet], HTTP_ANY, [](){outputValue();});

    //位置の調整
    server.on(httpContents[enmAdjust], HTTP_ANY, [](){setDevice(enmAdjust);});

    //wifi情報登録
    server.on(httpContents[enmWifi], HTTP_ANY, [](){setDevice(enmWifi);});
    //wifi情報登録Post
    server.on(httpContents[enmWF], HTTP_POST, [](){setDevice(enmWF);});

    // 登録されてないパスにアクセスがあった場合
    server.onNotFound([](){
        bzErrorSound();
        server.send(404, "text/plain", errorMessage[enmNotFound]); // 404を返す
    });

    server.begin();
}

//*************************************
void setDevice(int contentNum)
{
    deviceStatus device;
    deviceStatus *p_device;
    auto *func = &openMotorF;

    int portLED;

    String returnMessage = "";
    // String paramSts = server.arg("sts");
    String paramMelody = server.arg("melody");
    // String paramLength = server.arg("length");
    String paramInterval = server.arg("interval");
    String paramTarget = server.arg("target");
    String paramDirection = server.arg("direction");
    String paramRing = server.arg("ring");
    String paramMotion = server.arg("motion");

    String paramItem = server.arg("item");
    String paramValue = server.arg("value");
    // String paramSsid = server.arg("ssid");
    // String paramPass = server.arg("pass");
    // String paramHostname = server.arg("hostname");

    String Position = "water";
    switch(contentNum)
    {
        case enmNow://-------------------------------------------------------
            if(paramTarget == "w")
            { 
                device = deviceSts_W;
                p_device = &deviceSts_W;
                sr.println("area = w");
                func = &openMotorW;
            }
            else if(paramTarget == "f")
            {
                sr.println("area = f");
                Position = "food";
                device = deviceSts_F;
                p_device = &deviceSts_F;
                func = &openMotorF;
            }
            else
            {
                bzErrorSound();
                returnMessage = "error";
                break;
            }
            
            if( device.opened == false && 
                device.oppenning == false && 
                device.closing == false)
            {
                bzReceivedRing();
                // if(paramLength != "") device.nowLength = atoi(paramLength.c_str());
                // else device.nowLength = DEFAULT_LENGTH;
                device.flgNow = true;
                device.oppenning = true;
                *p_device = device;
                returnMessage = GetResponsMessage(Position, "now");
                // returnMessage = "successed";
                // returnMessage = 
                //     "{%s:\"%s\",%s:\"%s\",%s:\"%s\",%s:\"%s\"}", 
                //     ResponsWord.Position, Position,
                //     ResponsWord.Motion, "\"now\"",
                //     ResponsWord.Item, "\"\"",
                //     ResponsWord.Value, "\"\"";

                // returnMessage += "{";
                // returnMessage += ResponsWord.Position + ":\"" + Position + "\",";
                // returnMessage += ResponsWord.Motion + ":\"now\",";
                // returnMessage += ResponsWord.Item + ":\"\",";
                // returnMessage += ResponsWord.Value + ":\"\"";
                // returnMessage += "}";
            }
            else{
                bzErrorSound();
                returnMessage = "error";
            }
            break;
        case enmSet://-------------------------------------------------------
            if(paramTarget == "w")
            { 
                device = deviceSts_W;
                p_device = &deviceSts_W;
                func = &openMotorW;

                portLED = PORT_LED_W;
                // bzReceivedRing();
            }
            else if(paramTarget == "f")
            {
                device = deviceSts_F;
                p_device = &deviceSts_F;
                func = &openMotorF;
                Position = "food";

